## ===================================================================================
## [빅데이터를 활용한 스마트 데이터 전문가 양성과정]  ================================
## [제대로 알고 쓰는 통계분석 R]                      ================================
## 2019-06-25(화) / 가설검정 220page                  ================================
## ===================================================================================


### ================================================================================
###  1. 모수 상태에 대한 가설 결정하기 (220Page) ==================================
### ================================================================================

# 1. 가설 수립 H0(귀무가설) H1(대립가설)
# 2. 검정 통계량 
# 3. 유의수준 5%(alpha=0.05)
# 4. 판정 : H0 채택 기각.

setwd("D:/dudwlsrla92/R_Statistics/ch06")
getwd()

data <- read.csv("2010_6차.csv",header=T)

pt(0.727,14) # 누적확률이 0.76

tmp <- subset(data, data$나이==7)
height.p <- tmp$X104.키

set.seed(9)
height <- height.p[sample(length(height.p),15)]
height

mean(height)   #  Xbar = 1230
sd(height)     #    s  = 45.75
t.test(height,mu=1220)

(1230-1220)/(45.75/sqrt(15)) # 0.8465 즉 H0을 채택한다.
qt(0.975,14) # 기각역의 기준

# One Sample t-test
# two Sample t-test는 등분산성(var.test)을 알아봐야한다. 즉 분산이 같아야한다.
# 검정통계량으로 가설 선택의 기준을 수립하고 보려면 분포마다의 공식을 알고 있어야 한다.
# 그렇기 때문에 P-Value(유의확률)로 연구자가 정한 유의수준보다 크면 H0가설 채택한다.
# 또한 분포의 정규성을 이루는 지를 확인하는것에서도 이용한다. P-Value



### ================================================================================
###  2. 단일 모집단의 가설검정 (231Page) ==========================================
### ================================================================================

data <- read.table("http://www.amstat.org/publications/jse/datasets/babyboom.dat.txt",header=F)
str(data)

names(data) <- c("title","gender","weight","minutes")
tmp <- subset(data, gender==1)
weight <- tmp[[3]]

barx <- mean(weight)
s    <- sd(weight)
n    <- length(weight)
h0   <- 2800
t.t  <- (barx - h0)/(s/sqrt(n))

alpha <- 0.05
c.u   <- qt(1-alpha,df=n-1) 
p.value <- 1 - pt(t.t, df=n-1)

t.test(weight, mu=2800, alternative = "greater")

# 도표작성
par(mar=c(0,1,1,1))
x <- seq(-3,3, by=0.001)
y <- dt(x,df=n-1)
plot(x,y,type="l",axes=F,ylim=c(-0.02,0.38),
     main="",xlab="t",ylab="")
abline(h=0)

polygon(c(c.u, x[x>c.u],3),c(0,y[x>c.u],0),col=2)
text(c.u, -0.02, expression(t[0.05]==1.74))
text(1.8,0.2,expression(alpha==0.05),cex=0.8)
arrows(1.8,0.18,1.8,0.09,length=0.05)

polygon(c(t.t, x[x>t.t],3),c(0,y[x>t.t],0),density=20,angle=45)
text(t.t, -0.02,paste0("t=",round(t.t,3)),pos=4)
text(2.65,0.1,expression(plain(p)(T>2.333)==0.0196),cex=0.8)
arrows(2.7,0.08,2.5,0.03,length=0.05)



### ================================================================================
###  3. 단일 모집단 비율에 대한 가설검정 (237Page) ================================
### ================================================================================


tmp <- read.table("restitution.txt",header=T)
rel <- ifelse(tmp$rst<0.4134 | tmp$rst>0.4374,1,0)

n   <- length(rel)
nos <- sum(rel)
sp  <- nos/n
hp  <- 0.1
(z  <- (sp-hp)/sqrt((hp*(1-hp))/n))

alpha <- 0.05
(c.u     <- qnorm(1-alpha) )
(p.value <- 1- pnorm(z))

prop.test(nos, n, p=0.1, alternative = "greater",correct=F)


### ================================================================================
###  4-1. 연습문제(모비율 추정) ===================================================
### ================================================================================

#1. n명 임의 추출 50%의 학생이 대중교통을 이용하여 등교함. 
#   전체 학생 중에서 대중교통 등교 학생의 비율 P에 대한 신뢰도 95%의 신뢰 구간을 구하시오.
p.hat <- 0.5
alpha <- 0.05
n <- 100
z <- qnorm(1-(alpha/2))
ll <- p.hat - z*sqrt(p.hat*(1-p.hat)/n)
ul <- p.hat + z*sqrt(p.hat*(1-p.hat)/n)
ll ; ul

#2. 메뉴에 대한 선호도 고객 100명 임의추출. 4/5가 선호. 
#   전체 고객의 선호도 P라고 할 떄, 모비율 P에 대한 신뢰도 95%의 신뢰구간을 구하시오.
p.hat <- 0.8
alpha <- 0.05
n <- 100
z <- qnorm(1-(alpha/2))
ll <- p.hat - z*sqrt(p.hat*(1-p.hat)/n)
ul <- p.hat + z*sqrt(p.hat*(1-p.hat)/n)
ll ; ul

#3. 성인 남자 1,000명 추출. 430명 흡연.
#   흡연율(모비율)에 대한 90%신뢰구간을 추정.
p.hat <- 430/1000
alpha <- 0.1
n <- 1000
z <- qnorm(1-(alpha/2))
ll <- p.hat - z*sqrt(p.hat*(1-p.hat)/n)
ul <- p.hat + z*sqrt(p.hat*(1-p.hat)/n)
ll ; ul

### ================================================================================
###  4-2. 연습문제(1-Sample T-test) ===============================================
### ================================================================================

#1. 건전지 수명시간 1000시간, 10개일 때 샘플이 모집단과 같다고 할 수 있는가.
Battery<-c(980,1008,968,1032,1012,996,1021,1002,996,1017) 
t.test(Battery,mu=1000) 
# P-Value(0.611)>0.025이므로 H0을 채택(같다)

#2. 수학 평균성적 55점 0교시 수업 시행 후 성적 올랐다고 할 수 있는가.
math_0<-c(58,49,39,99,32,88,62,30,55,65,44,55,57,53,88,42,39) 
t.test(math_0,mu=55,alternative="greater") 
# P-Value(0.4096)>0.05이므로 H0을 채택(성적이 같다.)

#3. 평균알코올 섭취량 8.1g 평균 알코올 섭취량이 달라졌다고 할 수 있는가.
Alcohol<-c(15.50,11.21,12.67,8.87,12.15,9.88,2.06,14.50,0,4.97) 
t.test(Alcohol,mu=8.1)
# P-Value(0.5301)>0.025이므로 H0을 채택(평균 알코올 섭취량이 달라지지 않았다.)

