##� ===================================================================================
##� [빅데이터를 활용한 스마트 데이터 전문가 양성과정]  ================================
##� [제대로 알고 쓰는 통계분석 R]                      ================================
##� 2019-06-19-(수) / 63page                           ================================
##� ===================================================================================

### ===================================================================================
### � 2. 모수와 통계량   ==============================================================
### ===================================================================================

setwd('D:/dudwlsrla92/R_Statistics/ch02')
getwd()

ranicafe <- read.csv('cafedata.csv',stringsAsFactors = F)
str(ranicafe)
dim(ranicafe)

### ===================================================================================
##� 1) 최댓값과 최솟값: ranicafe 커피판매량
### ===================================================================================

ranicafe$Coffees<-as.numeric(ranicafe$Coffees)
sort(ranicafe$Coffees)
sort(ranicafe$Coffees)[1]
sort(ranicafe$Coffees,decreasing=T)
sort(ranicafe$Coffees,decreasing=T)[1]
min(ranicafe$Coffees,na.rm=T)
max(ranicafe$Coffees,na.rm=T)


### ===================================================================================
##� 2) 최빈값: ranicafe
### ===================================================================================

stem(ranicafe$Coffees)
hist(ranicafe$Coffees)
# 줄기-잎 그림을 통해 최빈값은 4라는 것을 알 수 있다.


### ===================================================================================
##� 3) 평균과 중앙값: ranicafe
### ===================================================================================

### 대푯값 : 전체자료를 대표하는 값으로 중심 위치를 나타내는 특성을 사용합니다.
### 자료의 중심은 무게중심:(산술)평균, 순서상 중간:중앙값
### 평균은 이상치에 약하다.
### 평균과 중앙값이 비슷한 경우 평균(혹은 중앙값)을 중심으로 좌우대칭인 경우가 많다.

# ①-1) 평균(끝 값의 변화에 민감함.)
rc <- ranicafe$Coffees
weight <-1/(length(rc)-1)   # NA 개수를 빼주어야 해서 -1 해줌.
sum(rc*weight,na.rm=T)      # 평균
mean(rc, na.rm=T)

# ①-2) 이상치가 있는 평균
rc[rc == max(rc,na.rm=T)] <- 480 # 이상치를 넣은 상태.
mean(rc, na.rm=T)

# ②-1) 중앙값(양 끝값의 변화에 둔감하다.)
median.idx <- (1+length(rc)-1)/2 # ex) 1,2,3,4,5에서 3은 (1+5)/2로 구할 수 있다.
sort(rc)[median.idx]

median(rc,na.rm=T)


### ===================================================================================
##� 4) 분산과 표준편차
### ===================================================================================

### 대푯값에서 취약한 데이터의 퍼진 정도를 알 수 있다.


height <- c(164,166,168,170,172,174,176)
(height.m   <- mean(height))
(height.dev <- height - height.m)  # 거리를 알기 위해 평균값으로 하나씩 빼준다.
sum(height.dev)                    # 모든 합이 같은 값의 +와 -로 인해 0

height.dev2 <- height.dev^2  
sum(height.dev2)
variance <- sum(height.dev2)/length(height) # 분산값
standard_deviation <- sqrt(variance)        # 표준편차 (분산을 루트씌운것)

mean(height)                  
var(height)
sd(height)   # R에서는 모집단(N)이 아닌 표본집단(n)으로 나눈다. 즉, 표본의 분산과 표준편차이다.

#� 시그마(xi-u)^2     시그마(Xi-x바)^2        u(뮤) : 모집단 평균 x바: 표본집단 평균
#� --------------     ----------------        N     : 모집단 갯수 n  : 표본집단 갯수     
#�       N                   n-1


### ===================================================================================
##� 5) 사분위수(quantile : 퀀 타일) 25% 50% 75% 100%
### ===================================================================================

quantile(rc, na.rm=T)
qs <- quantile(rc, na.rm=T)
qs[4] - qs[2]    # 3분위수 - 1분위수
IQR(rc,na.rm=T)  # IQR(InterQuantile Range)

rc[rc==max(rc,na.rm= T)] <- 48 # 이상치를 원래 값으로
bp <- boxplot(rc,main="커피 판매량에 대한 상자도표",axes=F)

# 이상치(Outlier)
boxplot(cars$dist)
qs <- quantile(cars$dist)
qs 
iqr <- qs[4]-qs[2]            ;iqr        # +30  중간값
UpperLimit <- qs[4] + 1.5*iqr ;UpperLimit # +101 보다 큰 것
LowerLimit <- qs[2] - 1.5*iqr ;LowerLimit # -19  보다 작은 것이 이상치가 된다.

cars$dist[cars$dist>UpperLimit]           # 위의 이상치
cars$dist[cars$dist<LowerLimit]           # 밑의 이상치

# 모수는 모집단
# 통계량은 표본집단을 뜻한다.